* TODO User Panel[2/3]
** DONE Statements[2/2]
   CLOSED: [2020-01-21 Sal 19:03]
*** DONE Add Statements Page
    CLOSED: [2020-01-21 Sal 19:03] SCHEDULED: <2020-01-21 Sal>
    :LOGBOOK:
    CLOCK: [2020-01-21 Sal 18:32]--[2020-01-21 Sal 18:53] =>  0:21
    CLOCK: [2020-01-21 Sal 18:02]--[2020-01-21 Sal 18:27] =>  0:25
    :END:
** DONE Remove Track Number from Add Dist Page
   CLOSED: [2020-02-01 Cts 16:58]
** TODO Fix Dashboard
* TODO Admin Panel[10/11]
** DONE Add Admin Panel
   CLOSED: [2020-01-21 Sal 19:20] SCHEDULED: <2020-01-22 Çrş>
   :LOGBOOK:
   CLOCK: [2020-01-21 Sal 19:03]--[2020-01-21 Sal 19:20] =>  0:17
   :END:
** DONE Add Distribution Page[2/2]
   CLOSED: [2020-01-23 Prş 16:19] SCHEDULED: <2020-01-21 Sal>
   :LOGBOOK:
   CLOCK: [2020-01-21 Sal 19:22]--[2020-01-21 Sal 19:36] =>  0:14
   :END:
*** DONE Add Add Detail View
    CLOSED: [2020-01-21 Sal 20:56] SCHEDULED: <2020-01-21 Sal>
    :LOGBOOK:
    CLOCK: [2020-01-21 Sal 20:25]--[2020-01-21 Sal 20:56] =>  0:31
    :END:
*** DONE Add Delete View
    CLOSED: [2020-01-23 Prş 16:19]
** DONE Add Content ID
   CLOSED: [2020-01-23 Prş 16:48] SCHEDULED: <2020-01-23 Prş>
   :LOGBOOK:
   CLOCK: [2020-01-23 Prş 16:27]--[2020-01-23 Prş 16:48] =>  0:21
   :END:
** DONE Add Statistic
   CLOSED: [2020-01-24 Cum 19:21] SCHEDULED: <2020-01-23 Prş>
   :LOGBOOK:
   CLOCK: [2020-01-24 Cum 17:08]--[2020-01-24 Cum 19:21] =>  2:13
   CLOCK: [2020-01-23 Prş 17:11]--[2020-01-23 Prş 18:03] =>  0:52
   :END:
** DONE Add Statements
   CLOSED: [2020-01-31 Cum 19:34] SCHEDULED: <2020-01-23 Prş>
** DONE Add Statement for split pay
   CLOSED: [2020-02-03 Pzt 18:42] SCHEDULED: <2020-02-03 Pzt>
   :LOGBOOK:
   CLOCK: [2020-02-03 Pzt 17:07]--[2020-02-03 Pzt 18:42] =>  1:35
   :END:
** DONE Add addDist Page for Admin Panel
   CLOSED: [2020-02-01 Cts 17:12] SCHEDULED: <2020-02-01 Cts>
   :LOGBOOK:
   CLOCK: [2020-02-01 Cts 16:58]--[2020-02-01 Cts 17:12] =>  0:14
   :END:
** DONE Add Genre CRUD
   CLOSED: [2020-02-01 Cts 19:08] SCHEDULED: <2020-02-01 Cts>
   :LOGBOOK:
   CLOCK: [2020-02-01 Cts 17:52]--[2020-02-01 Cts 19:08] =>  1:16
   :END:
** DONE Add Annoucement CRUD
   CLOSED: [2020-02-02 Paz 18:51] SCHEDULED: <2020-02-01 Cts>
** TODO Fix Dashboard
** DONE Add split pay statement on view
   CLOSED: [2020-02-04 Sal 19:08] SCHEDULED: <2020-02-04 Sal>
   :LOGBOOK:
   CLOCK: [2020-02-04 Sal 17:08]--[2020-02-04 Sal 19:09] => 2:01
   :END:
* TODO Label Panel[1/4] 
** DONE Add Label Panel
   CLOSED: [2020-02-02 Paz 17:46] SCHEDULED: <2020-02-02 Paz>
   :LOGBOOK:
   CLOCK: [2020-02-02 Paz 17:26]--[2020-02-02 Paz 17:46] =>  0:20
   :END:
** TODO Unlock Artist Name
** TODO Fix Label Name
** TODO Add Dashboard
* TODO General[5/5]
** DONE Remove Track Number
   CLOSED: [2020-01-31 Cum 19:40] SCHEDULED: <2020-01-31 Cum>
** DONE Add Genre Model
   CLOSED: [2020-02-01 Cts 17:48] SCHEDULED: <2020-02-01 Cts>
** DONE Add Announcement Model
   CLOSED: [2020-02-01 Cts 17:48] SCHEDULED: <2020-02-01 Cts>
** DONE Add i18n
   CLOSED: [2020-02-02 Paz 19:55] SCHEDULED: <2020-02-02 Paz>
   :LOGBOOK:
   CLOCK: [2020-02-02 Paz 19:03]--[2020-02-02 Paz 19:55] =>  0:52
   :END:
** DONE Complete i18n
   CLOSED: [2020-02-03 Pzt 17:07]
